
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Поменялась цена";
	
	РассчитатьСуммуВСтроке(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Поменялось количество";
	
	РассчитатьСуммуВСтроке(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура Команда1(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуВСтроке(Строка, ТекстПользователю)

	Строка.Сумма = Строка.Количество * Строка.Цена * 0.9;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстПользователю;
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеПользователя();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Сотрудник.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("Стаж", 15);
	Человек.Вставить("ДатаПриема", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	
	Возврат Человек;
	
КонецФункции


#КонецОбласти












